# Основы SQL 
## Юнит 5. РАБОТА С БАЗАМИ ДАННЫХ. SQL
### Skillfactory: DSPR-19

_Работа с Metabase_

### 1.6. Таблицы

### Задание 1.6.2
Напишите запрос, который получает столбцы book_id, book_name, book_average_rating (именно в такой последовательности) из таблицы books.
_(Не забывайте перед отправкой кода проверять его работоспособность и соответствие условиям в Metabase!)_

### Как с помощью SQL получить данные из таблицы?  
Чтобы получить данные из определённой таблицы, в SQL используется ключевое слово FROM. Например, чтобы получить данные из столбцов author, book_name, book_id из таблицы books, нужно написать:

In [ ]:
select author, book_name, book_id
from books

SELECT + FROM
Синтаксис select + from достаточно прост:

select (названия столбцов через запятую) from (название таблицы)

Если же мы хотим получить данные сразу из всех столбцов, нет смысла перечислять их все. Вместо названий столбцов мы просто введем знак *:

In [ ]:
select *
from books

По умолчанию при выводе столбцы называются так же, как в исходной таблице. Для переименования нужно в SELECT после названия столбца из таблицы написать as:

In [ ]:
select author as author_name 
from books

С колонками можно проводить математические операции. Например, если мы хотим к рейтингу каждой книги добавить 3, нужно сделать следующее:

In [ ]:
select book_average_rating, book_average_rating + 3 as rating_plus_three
from books

С числовыми столбцами мы тоже можем проводить математические операции:

In [ ]:
select book_average_rating*book_ratings_count/(book_id + 20.)
from books

#### Что делать в ситуации деления на ноль?
Чтобы СУБД не возвращала ошибку, а просто на место деления на 0 ставила NULL (отсутствие значения), существует функция NULLIF(expr1, expr2). Эта функция при равенстве expr1 и expr2 возвращает NULL, а иначе — expr1. Пример использования:

In [ ]:
select book_id, book_average_rating/NULLIF((book_id - 20.), 0)
from books

### Задание 1.6.2
Напишите запрос, который получает столбцы book_id, book_name, book_average_rating (именно в такой последовательности) из таблицы books.

(Не забывайте перед отправкой кода проверять его работоспособность и соответствие условиям в Metabase!)

In [ ]:
select book_id, book_name, book_average_rating
from books

### Задание 1.6.3
Напишите запрос, который получает все столбцы из таблицы books.

In [ ]:
select *
from books

### Задание 1.7.1
Какие столбцы таблицы books имеют целочисленный тип?

Ответ:  
- book_id
- publishing_year
- book_ratings_count

Для обозначения символьных типов данных используют одинарные кавычки, например, так: SELECT 'Hello, world!' . Двойные кавычки же используют, когда используют название колонок, в котором есть пробелы, либо символы из другого языка, либо когда они конфликтуют с ключевыми словами СУБД. Например:

In [ ]:
select 1 as "SELECT", 'hi' as "Название с пробелом";

### Задание 1.7.2
Сколько столбцов с символьными типами данных (не являющихся числом) содержится в таблице books?  

Ответ: 6

### Задание 1.7.3
Содержатся ли в таблице books столбцы в формате даты и/или времени или в формате bool?

Ответ: нет

#### Различные типы данных можно переводить друг в друга с помощью оператора :

In [ ]:
select 2.13::int; --Перевод real в int
select '2018-3-1'::date; --Перевод строки в дату
select true::int::numeric; --Перевод bool в int, а потом в numeric 
                
select 2 = 3; #false
select 3 < 5; #true
select 'hi' != 'hello'; #true
select 3 >= -23;  #true

select author = book_name as author_book
from books;

#false
#false
#false
#false
...

### 1.8. Кортеж

Для поиска по строкам (кортежам) используется ключевое слово WHERE, после которого перечисляются условия на кортежи данных. Where идёт после ключевого слова FROM. Например:

In [ ]:
select book_name, author
from books 
where author = 'Charlaine Harris';

Условия можно комбинировать друг с другом с помощью скобок, and и or. Например, если мы хотим получить только книги Charlaine Harris с рейтингом выше 3 или количеством оценок больше 1000, мы напишем:

In [ ]:
select * 
from books 
where author = 'Charlaine Harris' 
    and (book_average_rating > 3 or book_ratings_count > 1000);